namespace NoBadConflicts
{
    class THe
    {
        public static string[] S_explanation_title = { "简介", "关于战斗", "关于背包", "这里空的"  };
        public static string[] S_explanation_main = {
            "    通过战斗获得奖励，用奖励强化你的部队以挑战更难的战斗\n"
                + "。\n。\n。\n"
                + "    鼠标点击以与按键交互\n"
                + "    对于显示不全的文本，试着滚动滚轮\n"
                + "    战斗中，按下WASD移动视角，滚动滚轮缩放视角\n"
                + "    按住鼠标左右滑动，移动关卡/部队列表\n", 
            "    每场战斗最多三星，分别于摧毁大本营、摧毁率达到50%和100%时达成，屏障节点和陷阱不计入摧毁率，重复摧毁不计入\n"
                + "    建筑的生命值和攻击力根据难度修正\n{Easy：0.6\nNormal：1\nDifficult：1.45}\n"
                + "    单击兵种卡片选择对应兵种，再次点击取消选择\n"
                + "    根据鼠标光圈颜色判断能否释放部队，红色为不可释放（仍可释放药水）\n"
                + "    等级更高的部队/建筑拥有更高的生命值和攻击力\n" 
                + "    少数建筑，如冰冻陷阱，随等级提高其持续时间\n"
                + "    觉醒部队会取代原有部队\n"
                + "    战斗中可按下按纽或空格暂停\n" 
                + "    将鼠标移动至建筑，可以查看其攻击范围和锁定的目标\n"
                + "    鼠标双击，可查看部队/建筑的信息\n"
                + "    摧毁率达到100%或部队消耗完（包括药水）战斗结束，也可以按下按键提前结束\n",
            "    背包中可查看持有碎片数量以及兵种数量、等级\n"
                + "    每场战斗结束后会根据获得星数和难度获得奖励\n"
                + "    前两关有保底碎片奖励，以后的非BOSS关卡奖励数为难度基数乘以星数\n"
                + "    BOSS关卡一定会获得固定数目的觉醒碎片，达到两星及以上会获得额外碎片\n"
                + "    消耗3个碎片获得对应等级天赋\n"
                + "    可将低级碎片合成为高级碎片，高级碎片分解为低级碎片（1：2）\n"
                + "    某一类部队可获得的等级提升是有限的（分布于各等级天赋中）\n"
                + "    某一类药水可获得的数量是有限的（分布于各等级天赋中）\n", 
            "    占位\n"
                + "。\n。\n。\n。\n。\n。\n。\n。\n。\n。\n。\n。\n。\n。\n。\n。\n。\n。\n。\n。\n"
                + "    因为第七关很难，所以第六关奖励大幅提升了\n"
                + "    2/28 奖励数量增加，已通关"
        };
        public static string[] S_package_text = { "C级碎片", "B级碎片", "A级碎片", "S级碎片", "EX级碎片",
            "获取天赋", "合成为高级碎片", "分解为低级碎片", "确认选择"};


        public static void AddAlltext(ref string ori)
        {
            foreach (var item in S_explanation_title) ori += item;
            foreach (var item in S_explanation_main) ori += item;
            foreach (var item in S_package_text) ori += item;
        }
    }
}
